Конфигурация отчетов/DataProcessors/СписокЗадачСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СписокЗадачСотрудника</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗадач</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаЗадачу</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗадачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/ИсторияВыволненияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВыволненияЗадач</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаЗадачу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/СостояниеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостояниеЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершенно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/ВзаимодействиеСЗадачей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВзаимодействиеСЗадачей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияВыволненияЗадач</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЗадачу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/СписокЗадачСотрудника/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияВыволненияЗадачСрезПоследних.СтатусВыполнения КАК СтатусВыполнения,
		|	ИсторияВыволненияЗадачСрезПоследних.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
		|	ИсторияВыволненияЗадачСрезПоследних.Сотрудник КАК Сотрудник,
		|	ИсторияВыволненияЗадачСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ИсторияВыволненияЗадач.СрезПоследних КАК ИсторияВыволненияЗадачСрезПоследних
		|ГДЕ
		|	ИсторияВыволненияЗадачСрезПоследних.Сотрудник = &Сотрудник
		|	И ИсторияВыволненияЗадачСрезПоследних.СтатусВыполнения <> &СтатусВыполнения";
	
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	Запрос.УстановитьПараметр("СтатусВыполнения", Перечисления.СостояниеЗадач.Завершенно);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокЗадач.Добавить();
		НоваяСтрока.СсылкаНаЗадачу = Выборка.Регистратор.СсылкаНаЗадачу.Ссылка;  
		НоваяСтрока.СостояниеЗадачи = Выборка.СтатусВыполнения;
				
	КонецЦикла;
	


КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыборНаКлиенте(СсылкаНаЗадачу)
	
КонецПроцедуры


&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СписокЗадачВыборНаСервере(Элемент.ТекущиеДанные.СсылкаНаЗадачу);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаЗадачу",Элемент.ТекущиеДанные.СсылкаНаЗадачу); 
	
	ОткрытьФорму("Документ.ВзаимодействиеСЗадачей.Форма.ФормаДокумента",ПараметрыФормы);
КонецПроцедуры
